In [2]:
# More more more

import pandas as pd
import numpy as np 

# Load the dataset
df = pd.read_csv("/Users/thomassimmons/Downloads/titanic.csv")

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
print(df.head())
print(df.info())
print(df.describe())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [7]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [10]:
df['Age'].fillna(df['Age'].median(), inplace=True)

/var/folders/kf/nt6wlgn90dvc9wsk7ttkqs4w0000gn/T/ipykernel_16661/1933487976.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(), inplace=True)

In [11]:
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
df['Embarked'].fillna(df['Embarked'].mode()[0], inplace=True)

In [13]:
print(df.isnull().sum())

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

In [14]:
df.drop(columns=['Cabin'], inplace=True)

In [15]:
print(df.isnull().sum())

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

In [16]:
df['Survived'] = df['Survived'].astype('category')

In [18]:
df.dtypes

PassengerId       int64
Survived       category
Pclass            int64
Name             object
Sex              object
Age             float64
SibSp             int64
Parch             int64
Ticket           object
Fare            float64
Embarked         object
dtype: object

In [19]:
df['Sex'] = df['Sex'].map({'male': 0, 'female': 1})

In [20]:
df['Sex']

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    1
889    0
890    0
Name: Sex, Length: 891, dtype: int64

In [21]:
df = pd.get_dummies(df, columns=['Embarked'], drop_first=True)

In [22]:
df['Family_Size'] = df['SibSp'] + df['Parch'] + 1

In [23]:
df['Family_Size']

0      2
1      2
2      1
3      2
4      1
      ..
886    1
887    1
888    4
889    1
890    1
Name: Family_Size, Length: 891, dtype: int64

In [25]:
df['Is_Alone'] = (df['Family_Size'] == 1).astype(int)

In [26]:
df['Is_Alone']

0      0
1      0
2      1
3      0
4      1
      ..
886    1
887    1
888    0
889    1
890    1
Name: Is_Alone, Length: 891, dtype: int64

In [27]:
print(df[df['Age'] > 60])

     PassengerId Survived  Pclass                                       Name  \
33            34        0       2                      Wheadon, Mr. Edward H
54            55        0       1             Ostby, Mr. Engelhart Cornelius
96            97        0       1                  Goldschmidt, Mr. George B
116          117        0       3                       Connors, Mr. Patrick
170          171        0       1                  Van der hoef, Mr. Wyckoff
252          253        0       1                  Stead, Mr. William Thomas
275          276        1       1          Andrews, Miss. Kornelia Theodosia
280          281        0       3                           Duane, Mr. Frank
326          327        0       3                  Nysveen, Mr. Johan Hansen
438          439        0       1                          Fortune, Mr. Mark
456          457        0       1                  Millet, Mr. Francis Davis
483          484        1       3                     Turkula, Mrs. (Hedwig)
493          494        0       1                    Artagaveytia, Mr. Ramon
545          546        0       1               Nicholson, Mr. Arthur Ernest
555          556        0       1                         Wright, Mr. George
570          571        1       2                         Harris, Mr. George
625          626        0       1                      Sutton, Mr. Frederick
630          631        1       1       Barkworth, Mr. Algernon Henry Wilson
672          673        0       2                Mitchell, Mr. Henry Michael
745          746        0       1               Crosby, Capt. Edward Gifford
829          830        1       1  Stone, Mrs. George Nelson (Martha Evelyn)
851          852        0       3                        Svensson, Mr. Johan

     Sex   Age  SibSp  Parch       Ticket      Fare  Embarked_Q  Embarked_S  \
33     0  66.0      0      0   C.A. 24579   10.5000       False        True
54     0  65.0      0      1       113509   61.9792       False       False
96     0  71.0      0      0     PC 17754   34.6542       False       False
116    0  70.5      0      0       370369    7.7500        True       False
170    0  61.0      0      0       111240   33.5000       False        True
252    0  62.0      0      0       113514   26.5500       False        True
275    1  63.0      1      0        13502   77.9583       False        True
280    0  65.0      0      0       336439    7.7500        True       False
326    0  61.0      0      0       345364    6.2375       False        True
438    0  64.0      1      4        19950  263.0000       False        True
456    0  65.0      0      0        13509   26.5500       False        True
483    1  63.0      0      0         4134    9.5875       False        True
493    0  71.0      0      0     PC 17609   49.5042       False       False
545    0  64.0      0      0          693   26.0000       False        True
555    0  62.0      0      0       113807   26.5500       False        True
570    0  62.0      0      0  S.W./PP 752   10.5000       False        True
625    0  61.0      0      0        36963   32.3208       False        True
630    0  80.0      0      0        27042   30.0000       False        True
672    0  70.0      0      0   C.A. 24580   10.5000       False        True
745    0  70.0      1      1    WE/P 5735   71.0000       False        True
829    1  62.0      0      0       113572   80.0000       False        True
851    0  74.0      0      0       347060    7.7750       False        True

     Family_Size  Is_Alone
33             1         1
54             2         0
96             1         1
116            1         1
170            1         1
252            1         1
275            2         0
280            1         1
326            1         1
438            6         0
456            1         1
483            1         1
493            1         1
545            1         1
555            1         1
570            1         1
625            1         1
630            1         1
672            1         1
745            3         0
829            1         1
851            1         1

In [28]:
print(df.sort_values(by='Fare', ascending=False).head())

     PassengerId Survived  Pclass                                Name  Sex  \
258          259        1       1                    Ward, Miss. Anna    1
737          738        1       1              Lesurer, Mr. Gustave J    0
679          680        1       1  Cardeza, Mr. Thomas Drake Martinez    0
88            89        1       1          Fortune, Miss. Mabel Helen    1
27            28        0       1      Fortune, Mr. Charles Alexander    0

      Age  SibSp  Parch    Ticket      Fare  Embarked_Q  Embarked_S  \
258  35.0      0      0  PC 17755  512.3292       False       False
737  35.0      0      0  PC 17755  512.3292       False       False
679  36.0      0      1  PC 17755  512.3292       False       False
88   23.0      3      2     19950  263.0000       False        True
27   19.0      3      2     19950  263.0000       False        True

     Family_Size  Is_Alone
258            1         1
737            1         1
679            2         0
88             6         0
27             6         0

In [34]:
print(df.groupby('Sex')['Survived'].mean())

Sex
0    0.188908
1    0.742038
Name: Survived, dtype: float64

In [33]:
df['Survived'] = df['Survived'].astype(int)

In [32]:
print(df.groupby('Pclass')['Age'].mean())

Pclass
1    36.812130
2    29.765380
3    25.932627
Name: Age, dtype: float64